newq_code = [
    [
        "数字营销时代内容的创作分发和消费呈现的特征是（ ）。",
        "专业化",
        "系统化",
        "集中化",
        "碎片化",
        "",
        "D",
        "单选"
    ],
    [
        "以下不属于数字营销的网络渠道的是（）。",
        "社区媒体",
        "短信",
        "电子商务平台",
        "搜索引擎",
        "",
        "B",
        "单选"
    ],
    [
        "数字营销与传统营销的区别包括（）。",
        "营销渠道的转变",
        "营销传播方式和内容的转变",
        "营销技术的转变",
        "营销理念的转变",
        "",
        "ABCD",
        "多选"
    ],
    [
        "数字营销能有效缓解市场上假货、不诚信等问题。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "媒体平台化和内容碎片化已经成为营销面临的传播常态。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "传统营销的营销思维是以商品为中心，重视商品的开发与生产。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "相较于传统营销，数字营销在营销方式上有所转变，营销内容并无变化。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "创建品牌符号理论的典型代表人物是（ ）。",
        "菲利普.科特勒",
        "艾·里斯",
        "杰克·特劳特",
        "大卫 奥格威",
        "",
        "A",
        "单选"
    ],
    [
        "提出基于消费者品牌价值的CBBE模型的美国学者是（ ）。",
        "大卫·奥格威",
        "凯文·莱恩·凯勒",
        "菲利普·科特勒",
        "艾·里斯",
        "",
        "B",
        "单选"
    ],
    [
        "以下属于数字营销客体的是（ ）。",
        "广告主",
        "品牌",
        "客户",
        "有价值信息",
        "",
        "BD",
        "多选"
    ],
    [
        "以下属于数字营销主体的是（ ）。",
        "数字媒体",
        "数字营销公司",
        "品牌",
        "广告主",
        "",
        "ABD",
        "多选"
    ],
    [
        "用户、客户、消费者可能是同一个人，也可能不是同一个人。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "以下属于有价值信息的衡量标准的是（）。",
        "有价值信息是具有聚焦性的内容",
        "有价值信息是高质量的信息",
        "有价值信息是情感性的信息",
        "有价值的信息是符合用户实际需求的信息",
        "",
        "ABCD",
        "多选"
    ],
    [
        "创建品牌形象理论的代表人物是菲利普.科特勒。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下属于视频内容型平台的是（ ）。",
        "爱奇艺",
        "微信",
        "抖音",
        "淘宝",
        "",
        "AC",
        "多选"
    ],
    [
        "有价值的信息通常是指符合用户实际需求的信息。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "关于品牌，主要有三种理论：符号论、形象论、关系论。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "CBBE品牌营销思维模型的六个维度中，显著性对应（ ）。",
        "品牌关系",
        "品牌内涵",
        "品牌反映",
        "品牌标识",
        "",
        "D",
        "单选"
    ],
    [
        "不失时机地采取适当措施，唤起和强化消费者的需要，是营销者在促成品牌认购的哪一个阶段需要做的（）。",
        "决定购买",
        "评价方案",
        "确认需求",
        "收集信息",
        "",
        "C",
        "单选"
    ],
    [
        "品牌建立在人的一系列心理现象和活动之上，以下属于情绪反应的是（ ）。",
        "喜好",
        "知道",
        "认同",
        "认识",
        "",
        "AC",
        "多选"
    ],
    [
        "品牌五星资产模型中，代表顾客对于品牌的知觉和反应的是（）。",
        "品牌知名度",
        "品牌联想度",
        "品牌忠诚度",
        "品牌认知度",
        "",
        "ABD",
        "多选"
    ],
    [
        "品牌的相关性代表消费者对品牌的了解程度，关系到消费者体验的深度。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "在影响消费者购买决策的因素中，以下属于心理因素的是（ ）。",
        "性别",
        "角色",
        "职业",
        "动机",
        "",
        "D",
        "单选"
    ],
    [
        "以下关于品牌认知基础元素之间的关系，描述正确的是（）。",
        "当相关性高于差异性时：表明品牌的独特性逐渐消失",
        "当差异性高于相关性时：表明品牌具有正确的发展方向和空间",
        "当相关性高于差异性时：表明品牌的独特性越来越明显",
        "当差异性高于相关性时：表明品牌发展方向和空间出现偏差",
        "",
        "AB",
        "多选"
    ],
    [
        "品牌认知度是指消费者对某一品牌在品质上的整体印象。( )",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "CBBE品牌营销思维模型的六个维度中，绩效和形象对应（ ）。",
        "品牌反映",
        "品牌标识",
        "品牌内涵",
        "品牌关系",
        "",
        "C",
        "单选"
    ],
    [
        "关于消费者购买决策过程，描述正确的是（ ）。",
        "确认需求—收集信息—决定购买—评价方案—购后行为",
        "确认需求—收集信息—评价方案—决定购买—购后行为",
        "收集信息—确认需求—评价方案—决定购买—购后行为",
        "确认需求—收集信息—评价方案—购后行为—决定购买",
        "",
        "B",
        "单选"
    ],
    [
        "以下属于影响消费者购买决策的社会因素是（ ）。",
        "社会阶层",
        "年龄",
        "经验",
        "文化",
        "",
        "AD",
        "多选"
    ],
    [
        "在品牌认知各基础元素中，差异性往往高于相关性。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "品牌认知的基础元素包括（ ）。",
        "认知度",
        "差异性",
        "尊重度",
        "相关性",
        "",
        "ABCD",
        "多选"
    ],
    [
        "品牌知名度可分为无知名度、提示知名度和第一提示知名度3个阶段。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下属于品牌营销思维模型的是（ ）。",
        "品牌动力金字塔模型",
        "大卫·艾克的品牌五星资产模型",
        "科特勒4R营销模型",
        "凯文·凯勒CBBE模型",
        "",
        "ABD",
        "多选"
    ],
    [
        "数字营销的路径是：建立品牌认同—促进品牌认知—实现品牌认购。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "锁定精准用户，通过微信、微博、论坛等带动社群的人群扩展，有效实现用户拉新是哪一个工作领域的岗位职责。（）",
        "社群营销",
        "用户运营",
        "客户关系管理",
        "品牌管理",
        "",
        "A",
        "单选"
    ],
    [
        "在《中国数字营销人才能力评估标准》中，以下属于二级能力指标的是（ ）。",
        "营销通用能力",
        "职场通用能力",
        "数据分析能力",
        "营销合规能力",
        "",
        "C",
        "单选"
    ],
    [
        "在《中国数字营销人才能力评估标准》中，以下属于一级能力指标的是（ ）。",
        "效果优化能力",
        "投放管理能力",
        "数据分析能力",
        "数字营销专业能力",
        "",
        "D",
        "单选"
    ],
    [
        "数字营销人才能力评估指标体系中，属于营销合规能力指标的是( )。",
        "广告法基础知识",
        "数据安全能力",
        "项目管理能力",
        "创意合规能力",
        "",
        "ABD",
        "多选"
    ],
    [
        "以下属于数字营销人才能力标准体系二级能力指标的是（）。",
        "营销合规能力",
        "数据分析能力",
        "行业洞察能力",
        "职场通用能力",
        "",
        "BC",
        "多选"
    ],
    [
        "以下属于数字营销人才能力标准体系一级能力指标的是（）。",
        "数字营销专业能力",
        "数据安全能力",
        "职场通用能力",
        "营销通用能力",
        "",
        "ACD",
        "多选"
    ],
    [
        "以下不属于4P营销理论要素的是（）。",
        "价格",
        "包装",
        "渠道",
        "产品",
        "",
        "B",
        "单选"
    ],
    [
        "4C营销理论中的“Cost”是指（ ）。",
        "促销成本",
        "沟通成本",
        "顾客成本",
        "产品成本",
        "",
        "C",
        "单选"
    ],
    [
        "以下属于科特勒数字时代4R营销理论构成要素的是（ ）。",
        "品牌价值构建",
        "人群画像与分析",
        "数字化覆信息触达",
        "营销关系交易与回报",
        "",
        "BCD",
        "多选"
    ],
    [
        "科特勒数字时代4R营销理论要素包括（）。",
        "数字化信息触达",
        "人群画像与分析",
        "营销关系交易与回报",
        "客户关系连接",
        "",
        "ABCD",
        "多选"
    ],
    [
        "4C营销理论可以完全取代4P营销理论。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下不属于科特勒数字时代4R营销理论要素的是（ ）。",
        "客户反应",
        "数字化信息触达",
        "客户关系连接",
        "营销关系交易与回报",
        "",
        "A",
        "单选"
    ],
    [
        "4C营销理论要素包括（ ）。",
        "顾客感应",
        "顾客需求",
        "顾客成本",
        "顾客便利",
        "",
        "BCD",
        "多选"
    ],
    [
        "4P营销理论产生于20世纪60年代的美国，是随着营销组合理论的提出而出现的。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "4P营销理论中的“Promotion”是指（ ）。",
        "价格",
        "产品",
        "促销",
        "渠道",
        "",
        "C",
        "单选"
    ],
    [
        "4R营销理论要素包括（）。",
        "关联",
        "反应",
        "关系",
        "投放",
        "",
        "ABC",
        "多选"
    ],
    [
        "4P营销理论要素包括（）。",
        "包装",
        "产品",
        "价格",
        "促销",
        "",
        "BCD",
        "多选"
    ],
    [
        "企业营销活动的实质是利用内部可控因素适应外部环境的过程。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "4P营销理论强调以（）为中心。",
        "产品",
        "市场",
        "企业",
        "顾客",
        "",
        "A",
        "单选"
    ],
    [
        "\"4P营销理论中",
        "影响企业营销活动效果的可控因素是（ ）。\"",
        "技术",
        "促销",
        "产品",
        "价格",
        "",
        "BCD",
        "多选"
    ],
    [
        "4P营销理论中的促销策略指的是企业以合理地选择分销渠道和组织商品实体流通的方式来实现其营销目标。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "科特勒数字时代4R营销理论中的“Relationship”是指（ ）。",
        "数字化信息触达",
        "营销关系交易与回报",
        "人群画像与分析",
        "客户关系连接",
        "",
        "D",
        "单选"
    ],
    [
        "市场营销活动的核心就在于制定并实施有效的市场营销组合。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "4C营销理论强调以（）为中心。",
        "顾客",
        "市场",
        "企业",
        "产品",
        "",
        "A",
        "单选"
    ],
    [
        "1990年，美国北卡罗来纳大学教授（）提出了4C营销理论。",
        "罗伯特·劳特朋",
        "格隆罗斯",
        "博登",
        "高斯达·米克维茨",
        "",
        "A",
        "单选"
    ],
    [
        "顾客需求有显性需要和潜在需要之分，显性的需要满足是迎合市场，潜在的需要满足是引导市场。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "4P营销理论中，以下属于企业可控因素的是（ ）。",
        "人口",
        "产品",
        "价格",
        "内部环境",
        "",
        "BC",
        "多选"
    ],
    [
        "4p营销理论认为价格、产品、经济、环境等属于影响企业营销活动的不可控因素。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下不属于客户洞察技术的是（）。",
        "客户聚类技术",
        "内容生产技术",
        "预测分析技术",
        "客户推荐技术",
        "",
        "B",
        "单选"
    ],
    [
        "以下不能用于客户洞察的营销技术是（ ）。",
        "预测分析技术",
        "客户推荐技术",
        "私域传播技术",
        "客户聚类技术",
        "",
        "C",
        "单选"
    ],
    [
        "在RFM模型中，交易金额和交易频次都很高，但最近一次交易时间远，此类客户属于（ ）。",
        "重要挽留客户",
        "重要发展客户",
        "重要保持客户",
        "重要价值客户",
        "",
        "C",
        "单选"
    ],
    [
        "以下不属于互动营销技术的是（）。",
        "营销自动化技术",
        "地理围栏技术",
        "私域传播技术",
        "智慧沟通服务技术",
        "",
        "A",
        "单选"
    ],
    [
        "以下属于互动营销技术的是（ ）。",
        "地理围栏技术",
        "私域传播技术",
        "智能交互体验技术",
        "智慧沟通服务技术",
        "",
        "ABCD",
        "多选"
    ],
    [
        "使用RFM模型进行客户分类依据的指标是（ ）。",
        "交易场景",
        "交易频率",
        "最近一次交易与当前时间的间隔",
        "交易金额",
        "",
        "BCD",
        "多选"
    ],
    [
        "营销内容的工具化降低了内容创作与生产的门槛，提高了内容生产的效率。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "品牌聚类模型可以分析客户更愿意购买的品牌特征。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "使用RFM模型进行客户价值分类时，交易次数多，但是贡献不大的客户属于（ ）。",
        "一般保持客户",
        "一般发展客户",
        "一般挽留客户",
        "一般价值客户",
        "",
        "A",
        "单选"
    ],
    [
        "产品聚类模型能够发现客户偏好购买的产品或产品组合。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "触点营销技术可以应用于营销自动化、数字广告、用户体验等领域。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "以下客户标签中，属于预测类标签的是（ ）。",
        "产品购买情况",
        "客户流失概率",
        "历史交易",
        "渠道使用频率",
        "",
        "B",
        "单选"
    ],
    [
        "客户标签构建的维度，由浅入深分别是（ ）。",
        "预测标签、事实标签、模型标签、原始标签",
        "原始标签、预测标签、模型标签、事实标签",
        "原始标签、事实标签、模型标签、预测标签",
        "预测标签、模型标签、事实标签、原始标签",
        "",
        "C",
        "单选"
    ],
    [
        "以下属于高质量客户数据评价标准的是（）。",
        "数据的完备性",
        "数据的准确性",
        "数据的时效性",
        "数据的有效性",
        "",
        "ABCD",
        "多选"
    ],
    [
        "对企业来说，识别客户数据的类型是非常重要的。客户数据类型主要有（ ）。",
        "行为数据",
        "身份数据",
        "定量数据",
        "定性数据",
        "",
        "ABCD",
        "多选"
    ],
    [
        "数据的时效性只决定了数据分析结果的快与慢，对企业利益并无影响。( )",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "客户标签的存在形式不包括以下哪一项。（）",
        "年龄",
        "性别",
        "数据分析能力",
        "交易金额",
        "",
        "B",
        "单选"
    ],
    [
        "按客户需求属性划分，客户需求可分为（）。",
        "功能需求",
        "精神需求",
        "体验需求",
        "审美需求",
        "",
        "ACD",
        "多选"
    ],
    [
        "按需求层次划分，客户需求可分为现实需求和潜在需求。( )",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "按照客户购买目的的不同，客户需求可分为（）。",
        "生产性需求",
        "生活性需求",
        "现实需求",
        "潜在需求",
        "",
        "AB",
        "多选"
    ],
    [
        "与服务需求相比，产品需求更具有情境适应性。( )",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "标签是指从原始数据加工而来的，能够直接为业务所用并产生业务价值的数据载体。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "数据的准确性是绝对的，不会存在偏差。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下不属于品牌核心价值定位内容的是（ ）。",
        "品牌情感价值",
        "品牌客户价值",
        "品牌功能价值",
        "品牌观念价值",
        "",
        "B",
        "单选"
    ],
    [
        "用户听到“噔，噔噔噔噔”，就会联想到英特尔，这种品牌价值形态属于（ ）。",
        "品牌声音",
        "品牌标志",
        "品牌广告语",
        "品牌广告歌曲",
        "",
        "A",
        "单选"
    ],
    [
        "企业进行品牌核心价值定位，需要考虑的要素是（ ）。",
        "符合行业本质",
        "区隔竞争对手",
        "洞察核心需求",
        "维护自身利益",
        "",
        "ABC",
        "多选"
    ],
    [
        "以下属于常见的品牌价值形态的是（ ）。",
        "品牌广告语",
        "品牌包装",
        "品牌标志",
        "品牌声音",
        "",
        "ABCD",
        "多选"
    ],
    [
        "声音标识，对于品牌传播来说意义不大，可以不予考虑。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "品牌包装、品牌标志以及品牌IP都是通过“视觉语言”传递品牌价值。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下属于品牌核心价值主题的是（）。",
        "象征性价值",
        "理性价值",
        "传播性价值",
        "感性价值",
        "",
        "ABD",
        "多选"
    ],
    [
        "理性的品牌核心价值着眼于功能性利益或者相关的产品属性。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "品牌的价值体系的构成是由（ ）。",
        "企业价值观",
        "客户价值观",
        "产品价值",
        "品牌价值感",
        "",
        "ACD",
        "多选"
    ],
    [
        "在传递品牌包装的形态语言上，图形语言最为准确，其次是文字信息。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "内容触达场景的基本要素包括（）。",
        "触达画面",
        "触达时间",
        "触达空间",
        "触达目的",
        "",
        "ABCD",
        "多选"
    ],
    [
        "以下属于数字营销内容定位方法的是（）。",
        "梳理用户的内容需求",
        "定位用户画像",
        "分析触达场景",
        "挖掘差异化的内容",
        "",
        "ABCD",
        "多选"
    ],
    [
        "利用“四圆法则”进行内容选题，选题方向包括（）。",
        "企业文化与故事",
        "行业相关内容",
        "产品深度内容",
        "与目标用户生活和工作相关的内容",
        "",
        "ABCD",
        "多选"
    ],
    [
        "挖掘差异化内容的方法和原则是人无我有、人有我优。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "文字、图片、视频、音频等都属于内容的表现形式。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "在分析触达场景时，为了提高用户体验，需要考虑（）。",
        "内容长短符合触达场景",
        "表现形式符合触达场景",
        "内容主题符合触达场景",
        "视觉风格要符合触达场景",
        "",
        "ABCD",
        "多选"
    ],
    [
        "以下各平台中，社交属性体现最明显的是（ ）。",
        "头条",
        "微博",
        "抖音",
        "微信",
        "",
        "D",
        "单选"
    ],
    [
        "通常所说的BAT三大平台，其中“A”是指（）。",
        "阿里巴巴",
        "百度",
        "抖音",
        "头条",
        "",
        "A",
        "单选"
    ],
    [
        "品牌传播的手段包括（ ）。",
        "广告",
        "人际传播",
        "各种媒介资源",
        "公关",
        "",
        "ABCD",
        "多选"
    ],
    [
        "以下属于品牌常用的视频传播渠道的是（ ）。",
        "B站",
        "微信",
        "微博",
        "抖音",
        "",
        "AD",
        "多选"
    ],
    [
        "百度的广告核心是售卖客户消费数据。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "对于客户互动时机的把握，企业要考虑的问题是（）。",
        "互动的渠道和方式",
        "互动时间和频率",
        "互动的时间和地点",
        "互动的对象和形式",
        "",
        "B",
        "单选"
    ],
    [
        "进行客户互动的主要目的是（ ）。",
        "调整客户状态",
        "增加客户数量",
        "降低获客成本",
        "延长客户生命周期",
        "",
        "AD",
        "多选"
    ],
    [
        "注册有礼、首单立减、免费试用、新用户专享等活动都属于留存类活动。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "潜在客户是指那些有希望成为企业产品或者服务的购买者的客户。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "数字媒体（Digital Media）是以（ ）数的形式获取、记录、处理和传播过程的信息载体。",
        "二进制",
        "十进制",
        "末位制",
        "算法制",
        "",
        "A",
        "单选"
    ],
    [
        "以下付费方式，属于按点击付费的是（）。",
        "CPC",
        "CPS",
        "CPM",
        "CPA",
        "",
        "A",
        "单选"
    ],
    [
        "“品效合一”广告营销思维中的“品效合一”是指（ ）。",
        "实际销售效果",
        "品牌价值",
        "传播效率",
        "品牌效应",
        "",
        "AD",
        "多选"
    ],
    [
        "“品效合一”营销思维旨在追求短期销售转化和长期品牌效益相结合的双重提升。（ ）",
        "正确",
        "错误",
        "",
        "",
        "",
        "B",
        "判断"
    ],
    [
        "企业在追求“品效合一”的过程中，产品是品牌的充分但非必要条件。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "传统媒体是“受众主导型”，而数字媒体是“主导受众型”。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "利用微信、微博等工具进行营销的方式属于（）。",
        "自动化营销",
        "推荐引擎营销",
        "联盟营销",
        "社交媒体营销",
        "",
        "D",
        "单选"
    ],
    [
        "以下属于数字广告营销渠道与传统渠道差异的是（）。",
        "传播目的不同",
        "传播媒介不同",
        "传播方式不同",
        "用户管理方式不同",
        "",
        "BCD",
        "多选"
    ],
    [
        "世界上最早的竞价广告起源于百度。（ ）",
        "正确",
        "错误",
        "",
        "",
        "",
        "B",
        "判断"
    ],
    [
        "数字广告营销渠道的传播方式具有双向性和互动性的特点。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "传统媒体营销的特点是重新构建人与人之间的沟通方式，可实现信息的全网覆盖。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "适用于有明确搜索意图情况下进行检索的搜索引擎是（ ）。",
        "全文搜索引擎",
        "垂直搜索引擎",
        "目录搜索引擎",
        "元搜索引擎",
        "",
        "B",
        "单选"
    ],
    [
        "以下属于按照实际销售产品的数量来计算营销推广费用的计价方式是（ ）。",
        "CPM",
        "CPA",
        "PT",
        "CPS",
        "",
        "D",
        "单选"
    ],
    [
        "以下属于搜索引擎索引库维护方式的是（）。",
        "定点搜集",
        "定期搜集",
        "累加搜集",
        "增量搜集",
        "",
        "BD",
        "多选"
    ],
    [
        "按照搜索引擎搜索方式的不同，可将搜索引擎分为（ ）。",
        "目录搜索引擎",
        "元搜索引擎",
        "全文搜索引擎",
        "垂直搜索引擎",
        "",
        "ABCD",
        "多选"
    ],
    [
        "搜索引擎是主动发现用户当前或潜在需求的定律，并主动推送信息给用户的信息网络。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "搜索引擎广告营销具有传统营销手段无可比拟的优势，在应用的过程中没有缺陷。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "搜索引擎具有信息抓取迅速、深入开展信息挖掘、检索内容多样化等特点。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "根据是否为不同的用户推荐不同的数据，可以将推荐引擎分为基于大众行为的推荐引擎和（ ）。",
        "基于人口统计学的推荐引擎",
        "个性化推荐引擎",
        "基于协同过滤的推荐引擎",
        "基于内容的推荐引擎",
        "",
        "B",
        "单选"
    ],
    [
        "对于推荐引擎上某广告的预估点击率为2.5%，其出价为100元，那么这条广告的预估收益为（ ）。",
        "25",
        "25.1",
        "2.51",
        "2.5",
        "",
        "D",
        "单选"
    ],
    [
        "以下属于推荐引擎广告的排名机制影响因素的是（ ）。",
        "商品表现",
        "广告预算",
        "预估收益",
        "出价",
        "",
        "CD",
        "多选"
    ],
    [
        "以下属于推荐引擎广告特点的是（）。",
        "广告互动性强",
        "营销精准",
        "移动碎片化",
        "定位方式多样",
        "",
        "ABCD",
        "多选"
    ],
    [
        "根据推荐模型的建立方式，可以将推荐引擎分为基于人口统计学的推荐、基于内容的推荐以及基于协同过滤的推荐。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下属于推荐引擎广告投放流程内容的是（ ）。",
        "设计广告落地页",
        "筛选投放关键词",
        "制定关键词表",
        "制作广告创意",
        "",
        "AD",
        "多选"
    ],
    [
        "推荐引擎广告采用的是遵循下一名计费制。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "互动营销是精准营销模式的核心组成部分，是实现和客户互动的主要手段之一。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "以下属于间接收集的第二方数据的是（）。",
        "与合作伙伴交换的数据信息",
        "登录浏览网站的点击行为记录",
        "工商登记注册的信息",
        "在线购物的商品交易支付记录",
        "",
        "A",
        "单选"
    ],
    [
        "以下不属于客户行为特征的指标是（）。",
        "位置轨迹",
        "联络数据",
        "内容偏好",
        "消费记录",
        "",
        "D",
        "单选"
    ],
    [
        "数字互动营销客户数据分析指标主要包括（ ）。",
        "旅行轨迹",
        "行为特征",
        "交易消费",
        "人口属性",
        "",
        "BCD",
        "多选"
    ],
    [
        "常用的客户分层方法有（ ）。",
        "ABC客户分层法",
        "长尾理论分层法",
        "SWOT客户分层法",
        "客户生命周期分层法",
        "",
        "ABD",
        "多选"
    ],
    [
        "客户生命周期动态地描述了客户关系在不同阶段的总体特征。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "在ABC客户分层法中，关键客户包括（ ）。",
        "A类和C类客户",
        "A类和B类客户",
        "C类和D类客户",
        "B类和C类客户",
        "",
        "B",
        "单选"
    ],
    [
        "客户分层的“长尾理论”和“二八定律”是相互对立的。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下不属于App营销模式的是（）。",
        "多维竞价模式",
        "用户参与模式",
        "植入广告模式",
        "购物网站移植模式",
        "",
        "A",
        "单选"
    ],
    [
        "常见的小程序种类有（）。",
        "支付宝小程序",
        "抖音小程序",
        "头条小程序",
        "微信小程序",
        "",
        "ACD",
        "多选"
    ],
    [
        "以下属于社交营销策略的是（ ）。",
        "搭建极致场景",
        "连接人际传播",
        "制作共鸣内容",
        "建立互动粘性社群",
        "",
        "ABCD",
        "多选"
    ],
    [
        "小程序也是一种应用程序，需要下载、安装才可使用。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "常见的裂变营销策略有（ ）。",
        "拼团裂变",
        "活动裂变",
        "口碑裂变",
        "内容裂变",
        "",
        "ABC",
        "多选"
    ],
    [
        "数字化营销面向的客户群体越精准，营销转化效果越好。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "口碑客户开发是指企业通过口碑传播的途径获取新客户，也就是常说的“老带新”。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "商家为增加用户再次购买的可能性所采取的营销行动称之为转化营销。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "分销裂变是消费者体验过后主动进行分享的一种裂变方式。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "在广告效果评估指标中，转化率的高低取决于转化量和（ ）。",
        "曝光率",
        "点击率",
        "点击量",
        "展现量",
        "",
        "C",
        "单选"
    ],
    [
        "下面可以用来分析内容黏性的指标是（ ）。",
        "阅读页停留时长",
        "分享渠道",
        "分享次数",
        "内容覆盖人数",
        "",
        "A",
        "单选"
    ],
    [
        "以下属于广告营销效果分析常用的方法是（ ）。",
        "四象限分析法",
        "TOP-N分析法",
        "广告营销漏斗分析法",
        "对比分析法",
        "",
        "ABCD",
        "多选"
    ],
    [
        "为了提升客户留存与活跃，可采用的方式有（ ）。",
        "数据反推，找到关键点",
        "有效触达，唤醒客户",
        "搭建激励体系，留存客户",
        "丰富内容，增加客户在线时长",
        "",
        "ABCD",
        "多选"
    ],
    [
        "逻辑树分析方法是把若干简单问题整合成一个综合问题。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "以下属于线上数据技术获取的方式是（ ）。",
        "免费开源",
        "数据埋点",
        "企业内部数据",
        "线下调研数据",
        "",
        "B",
        "单选"
    ],
    [
        "广告营销漏斗模型适用于目前大多数互联网广告。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "以下属于曝光优化内容的是（）。",
        "点击量优化",
        "转化量优化",
        "落地页优化",
        "渠道（媒体）优化",
        "",
        "D",
        "单选"
    ],
    [
        "以下属于点击优化内容的是（ ）。",
        "创意（素材）优化",
        "广告位优化",
        "出价优化",
        "定向优化",
        "",
        "AD",
        "多选"
    ],
    [
        "以下属于营销效果优化思路的是（ ）。",
        "开发长尾渠道价值",
        "全方位渠道整体运作",
        "识别各渠道重要性",
        "建立绩效评估基准线",
        "",
        "ABCD",
        "多选"
    ],
    [
        "在进行营销效果优化时，以下属于曝光优化的是（）。",
        "出价优化",
        "落地页优化",
        "广告位优化",
        "渠道优化",
        "",
        "ACD",
        "多选"
    ],
    [
        "高质量的落地页，能够提升广告的点击率。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "在进行落地页优化时既要关注跳出率等数据，还要重视客户评价等反馈信息。（ ）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "竞争对手既包括基于产品角度的竞争对手，也包括基于受众需求视角的竞争对手。下面选项中不属于小米电视的竞争对手的是（）。",
        "网络视频平台",
        "长虹电视",
        "电商平台",
        "创维电视",
        "",
        "C",
        "单选"
    ],
    [
        "海尔空调承诺质保期内免费维修，这属于产品的（）价值层。",
        "核心产品",
        "附加产品",
        "期望产品",
        "潜在产品",
        "",
        "B",
        "单选"
    ],
    [
        "形式产品价值层是指产品得以实现的具体形式和外在特征，是产品的载体，是目标受众识别和选择的主要依据，对于有形产品，下面选项中哪些属于它的形式产品价值层（）。",
        "款式",
        "质量水平",
        "品牌名称",
        "特色",
        "",
        "ABCD",
        "多选"
    ],
    [
        "数字营销市场分析工作的流程包括（）。",
        "进行市场热点及行业发展趋势调研，完成目标受众分析",
        "了解公司产品的价值与特点",
        "进行竞争对手或同类产品的市场调研，完成竞争对手分析",
        "跟踪、分析和把握市场与技术发展趋势",
        "",
        "ABCD",
        "多选"
    ],
    [
        "广告营销市场分析是企业开展数字广告营销活动的立足点和根本前提，只有深入细致地调查、研究、分析企业市场营销环境，才能准确、及时地把握目标受众需求与市场需求。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "在波士顿矩阵中，将企业产品按各自的销售增长率和市场占有率分类，其中（）是保证企业运转的关键，应保持市场占有率并刺激增长。",
        "明星产品",
        "问号产品",
        "现金牛产品",
        "瘦狗产品",
        "",
        "C",
        "单选"
    ],
    [
        "长虹电视公司的竞争对手包括（）等。",
        "腾讯视频",
        "鸿星尔克",
        "创维电视",
        "小米",
        "",
        "ACD",
        "多选"
    ],
    [
        "数字营销的目标受众可以从哪些方面的来分析（）。",
        "地域因素分析",
        "心理因素分析",
        "基本属性分析",
        "行为因素分析",
        "",
        "ABCD",
        "多选"
    ],
    [
        "潜在产品价值层是指现有产品包括所有附加产品在内的、未来可能发展出现的潜在状态的产品，包括现有产品的所有延伸和演进部分。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "形式产品价值层是指产品得以实现的具体形式和外在特征，是产品的载体，是目标受众识别和选择的主要依据。而对于服务类产品，主要由（）组成。",
        "地点",
        "人员",
        "服务的程序",
        "品牌",
        "",
        "ABCD",
        "多选"
    ],
    [
        "期望产品价值层是指目标受众在购买产品时期望得到的与产品密切相关的一系列基本属性和条件，比如对于酒店企业，下面选项属于期望价值层的是（）。",
        "房间整洁",
        "环境安静",
        "服务周到",
        "交通便利",
        "",
        "ABCD",
        "多选"
    ],
    [
        "目标受众的购买路径可分为（）5个阶段。",
        "了解、兴趣、问询、行动、拥护",
        "了解、吸引、问询、行动、介绍",
        "了解、吸引、问询、行动、拥护",
        "了解、吸引、咨询、行动、拥护",
        "",
        "C",
        "单选"
    ],
    [
        "促使社会形成新的消费意向并对本酒店产品产生独特好感的广告，属于哪种广告内容？（）",
        "竞品广告",
        "产品广告",
        "企业形象广告",
        "观念广告",
        "",
        "D",
        "单选"
    ],
    [
        "根据营销漏斗，可以确定各个层级哪些营销指标？（）",
        "转化率",
        "点击率",
        "跳出率",
        "展现量",
        "",
        "ABCD",
        "多选"
    ],
    [
        "广告内容的FAB生产法是指从产品的（）维度进行创作的方法。",
        "利益",
        "特点",
        "价格",
        "优点",
        "",
        "ABD",
        "多选"
    ],
    [
        "落地页整体页面结构应该简洁、明了、美观，对于进行线索收集的企业来说，表单设计上一定要简化。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "受到好奇心的驱使，目标受众会积极地跟进喜爱的住宿风格，这时，酒店的广告营销目标应该是（）。",
        "进行详细的产品介绍，创造产品购买需求",
        "促进销售转化",
        "传递品牌信息",
        "讲述品牌佳话",
        "",
        "A",
        "单选"
    ],
    [
        "热门口碑、热门搜索、2022最受欢迎的星级酒店榜，适合采用哪种视频表现方法设计广告内容？（）",
        "黄金时间",
        "受众燃点",
        "场景原生",
        "第一人称",
        "",
        "B",
        "单选"
    ],
    [
        "通过连续广告的形式，使目标受众加深对已有商品的认识，这更符合哪种广告内容的特点？（）",
        "企业形象广告",
        "保牌广告",
        "竞争广告",
        "创牌广告",
        "",
        "B",
        "单选"
    ],
    [
        "搜索竞价推广中下面哪个计划是按照投放时间策划的（）。",
        "钢琴在线培训-表单",
        "英语培训-北京",
        "小米手机-广东",
        "连衣裙-双十一特价",
        "",
        "D",
        "单选"
    ],
    [
        "搭建信息流广告账户时，目标受众定向可以在（）设置。",
        "计划",
        "单元",
        "落地页",
        "创意",
        "",
        "B",
        "单选"
    ],
    [
        "推荐引擎广告账户搭建时还可以按照定向受众的划分搭建，把不同目标受众划分为不同推广计划，下面选项中按照目标受众划分的是（）。",
        "25-3 岁的年轻白领",
        "电子商务师-北京",
        "18-24 岁的大学生",
        "促销活动-双十一",
        "",
        "AC",
        "多选"
    ],
    [
        "很多企业比如本地服务类企业的业务具有地域特性，需要针对特定地理位置进行投放，下面公司中的业务具备此类地域特性的有（）。",
        "婚纱摄影",
        "驾校",
        "空调上门维修",
        "钢琴线上培训课",
        "",
        "ABC",
        "多选"
    ],
    [
        "搜索竞价推广账户搭建必须要有一个出发点，围绕这个出发点进行拆分，便于后续管理调整。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "搭建信息流广告账户时，地域通配符可以在（）设置。",
        "计划",
        "落地页",
        "创意",
        "单元",
        "",
        "C",
        "单选"
    ],
    [
        "某企业业务涉及多个地域，公司想对比不同地域的数据和效果，那他可以根据地域新建不同的（）。",
        "落地页",
        "创意",
        "单元",
        "计划",
        "",
        "C",
        "单选"
    ],
    [
        "某企业的产品具有季节性，信息流推广也要分季节月份来区别，那他可以在（）维度进行区分。",
        "单元",
        "创意",
        "计划",
        "落地页",
        "",
        "C",
        "单选"
    ],
    [
        "信息流广告推广账户里面有多个推广计划，每个推广计划下面又有多个推广单元，推广单元下可以进行目标受众定向，每个推广单元下面又对应有多条创意。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "信息流账户搭建时对计划和单元的命名需要遵循的原则有（）。",
        "查找方便",
        "字数越多越好",
        "避免重复",
        "格式固定",
        "",
        "ACD",
        "多选"
    ],
    [
        "\"很多企业的业务具有地域特性",
        "从地理位置角度准确定位客户能够让公司做到“指定地域的目标受众才能够看到广告”，帮助企业触达业务覆盖地域内的目标受众或重点区域内的目标受众，有助于节省广告成本，提高广告效果。（）\"",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "搭建信息流广告账户时，表单提交/app下载按钮可以在（）设置。",
        "计划",
        "落地页",
        "单元",
        "创意",
        "",
        "B",
        "单选"
    ],
    [
        "账户搭建必须要有一个出发点，围绕这个出发点进行拆分，便于后续管理调整，各层级的命名方式也要遵循、查找方便、避免重复、格式固定的原则。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "搜索引擎广告账户搭建时还可以按照“词义相近，结构相同”原则，将关键词归类为不同推广单元，根据词义相近原则，可以搭建（）推广单元。",
        "商品词",
        "地域词",
        "品牌词",
        "通俗词",
        "",
        "ABCD",
        "多选"
    ],
    [
        "搭建搜索投放账户为计划、单元命名时，需要遵循（）原则。",
        "格式固定",
        "避免重复",
        "查找方便",
        "随意命名即可",
        "",
        "ABC",
        "多选"
    ],
    [
        "当业务覆盖范围出现貌似不能投放但实际可以辐射到时，可针对企业业务辐射范围制定地域策略。",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "信息流广告的账户可以按照时间策划搭建，下面选项中属于按照时间投放的是（）。",
        "按照重大活动时机投放",
        "按照节假日投放",
        "按照季节投放",
        "按每日不同段投放",
        "",
        "ABCD",
        "多选"
    ],
    [
        "附加产品价值层是指企业提供产品时增加的目标受众希望得到的附加服务和利益，主要包括（）为客户提供的各种服务。",
        "产品质量",
        "售中",
        "售后",
        "售前",
        "",
        "BCD",
        "多选"
    ],
    [
        "市场数据分析中对产品的分析，其中附加产品价值层是指企业提供产品时增加的目标受众希望得到的附加服务和利益，主要是指售前、售中、售后为客户提供的各种服务。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "企业在搭建搜索推广账户时，可以从哪些方面来区分不同的推广单元？（）",
        "创意素材",
        "产品类别",
        "活动分类",
        "推广目的",
        "",
        "ABCD",
        "多选"
    ],
    [
        "下面不是网站流量来源的是（）。",
        "外部链接",
        "竞争对手",
        "搜索引擎",
        "直接访问",
        "",
        "B",
        "单选"
    ],
    [
        "分析网站中的关键词排名时，可以通过（）途径对关键词进行查询。",
        "爱站网",
        "Chinaz",
        "百度指数",
        "百度搜索",
        "",
        "ABD",
        "多选"
    ],
    [
        "搜索排名分析时，可以分析竞争对手网站中的哪些关键词进行对比？（）",
        "长尾词",
        "行业词",
        "品牌词",
        "产品词",
        "",
        "ABCD",
        "多选"
    ],
    [
        "关键词的搜索指数越高，目标受众搜索的次数也就越大，就会有越大的企业进行该关键词的优化或者竞价，竞争程度也就越大。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "分析竞争对手排名时，可以利用搜索结果分析竞争对手的着陆页面，看其指向是否和搜索词相关。如果品牌词指向首页、产品词指向专题页面、行业词指向栏目页、长尾词指向内容页，说明其网页的关键词布局较好，竞争对手相对强劲。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "对网站排名分析时，使用各种工具查询网页的关键词排名后，需要建立关键词排名记录表，并根据表中关键词排名的变化，调整关键词的优化方案。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "短尾关键词一般多属于热门搜索词，特征是比较短，优点是搜索量大，下面属于短尾关键词的是（）",
        "在线课程多少钱",
        "通讯设备公司",
        "电脑",
        "哪里有好的培训班",
        "",
        "C",
        "单选"
    ],
    [
        "关键词筛选要坚持相关性原则，某化妆品企业设置的关键词有“口红，哑光，斩男色，餐馆”，其中不相关的需要筛选掉的关键词是（）。",
        "哑光",
        "斩男色",
        "餐馆",
        "口红",
        "",
        "C",
        "单选"
    ],
    [
        "品类词是指公司的主营产品或者主营服务的关键词，下面关键词中属于品类词的是（）",
        "风衣",
        "怎么投资理财",
        "针织衫",
        "连衣裙",
        "",
        "ACD",
        "多选"
    ],
    [
        "使用关键词变体拓展关键词，“平板电脑”的拓展词包括（）。",
        "pad",
        "智能平板",
        "平板",
        "皮包",
        "",
        "ABC",
        "多选"
    ],
    [
        "关键词的转化率是指某一段时间内转化行为的次数占广告信息总点击次数的比率。转化率是企业最核心的经营指标之一，转化率越高，说明营销效果越好。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "以下哪个关键词指标，可以反映出关键词及对应的创意对网民的吸引程度（）？",
        "转化率",
        "展现量",
        "转化成本",
        "点击率",
        "",
        "D",
        "单选"
    ],
    [
        "关键词中的价格词一般是产品+价格的语义性描述，下面关键词中属于价格词的是（）。",
        "手机排行榜",
        "热水器漏水怎么办",
        "小米手机多少钱",
        "戴森吸尘器价格",
        "",
        "CD",
        "多选"
    ],
    [
        "下面选项中属于关键词数据清洗原则的是（）。",
        "处理缺失的数据",
        "增加违规关键词",
        "删除无意义与违规关键词",
        "清除掉不必要的重复数据",
        "",
        "ACD",
        "多选"
    ],
    [
        "推广过程中，关键词的平均点击价格越低，表示单次点击付出的费用越少。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "关键词挖掘的价值在于能细分市场并开发新市场，带动更多的商业价值，一般情况下，挖掘关键词的第一步就是确定（），确定了之后再进行关键词扩展。",
        "品牌词",
        "价格词",
        "营销词",
        "核心关键词",
        "",
        "D",
        "单选"
    ],
    [
        "以下关于长尾关键词的说法中正确的是（）。",
        "长尾关键词是核心词",
        "长尾关键词竞争相对较小",
        "长尾关键词搜索量更大",
        "长尾关键词是热门关键词",
        "",
        "B",
        "单选"
    ],
    [
        "专有名词或专业术语包括人名、地名、行业专有名词等，下面关键词中属于专有名词的是（）",
        "吹风机",
        "北京",
        "扫地机器人",
        "周杰伦",
        "",
        "BD",
        "多选"
    ],
    [
        "以下属于关键词拓展方法的有（）。",
        "使用相关搜索拓展",
        "使用关键词挖掘工具拓展",
        "八爪鱼法拓展关键词",
        "使用其他各种关键词变体",
        "",
        "ABCD",
        "多选"
    ],
    [
        "关键词A的展现量是1000，点击量为40，关键词B的展现量为5000，点击量300，表示关键词A及其对应的创意对用户更有吸引力。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "关键词词组需要清洗掉违规关键词，下面关键词中属于违规词需要清洗掉的是（）。",
        "北京酒店",
        "五星酒店",
        "北京最好的五星级酒店",
        "环境不错的酒店",
        "",
        "C",
        "单选"
    ],
    [
        "某企业某个产品词的推广一段时间后展现量是5500，点击次数356次，转化量20个，共消费7000元，那么该关键词的转化率是（）。",
        "0.65",
        "0.56",
        "0.8",
        "0.13",
        "",
        "B",
        "单选"
    ],
    [
        "进行关键词数据清洗时，需要处理缺失的数据，缺失数据通常的表现形式为（）。",
        "空值",
        "重复数据",
        "错误标识符",
        "违规词",
        "",
        "AC",
        "多选"
    ],
    [
        "清洗关键词数据时，需要清洗掉缺失的数据，比如空值、错误标识符等数据。。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "下列关于排行榜词的描述正确的是（）。",
        "排行榜词是对产品和服务进行对比询问的词",
        "排行榜词可以引起消费者关注",
        "'手机畅销榜第一'是排行榜词",
        "排行榜词一般是价格词",
        "",
        "ABC",
        "多选"
    ],
    [
        "使用常见错别字进行关键词挖掘时会不可避免地要在页面中出现这些错别字，可能会给目标受众带来不好的网站体验，要慎重使用。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "下面步骤中，不属于搜索引擎建立索引的是（）。",
        "消除噪声",
        "正向索引",
        "内容筛选",
        "去重",
        "",
        "C",
        "单选"
    ],
    [
        "搜索引擎的排序是由各种算法综合打分后衡量的一个结果，影响排序的因素有很多，下面选项中哪项会影响搜索引擎的排序？（）",
        "页面中文字的字体",
        "页面时效性",
        "页面相关性",
        "页面体验",
        "",
        "BCD",
        "多选"
    ],
    [
        "“国家领导人推荐机构”这类关键词不属于违规关键词，不需要进行数据清洗。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "\"知识类词是关于某产品/服务的名词解释、背景/坏境、由来、分类等百科类的描述性关键词或询问性关键词",
        "下面关键词中属于知识类词的是（）。\"",
        "5块钱的电脑哪个好",
        "什么是1+x证书",
        "双十一半价",
        "考试不及格怎么办",
        "",
        "B",
        "单选"
    ],
    [
        "如果某关键词推广一段时间后发现单次点击扣费过高，那么可以尝试调低（）来控制单次点击价格",
        "关键词出价",
        "账户预算",
        "调价系数",
        "OCPC出价",
        "",
        "ACD",
        "多选"
    ],
    [
        "A网站的点击量为334，点击率为45.2%；B网站的点击量为422，点击率为33.3%，这说明B网站广告的吸引用户的程度更高。",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "B",
        "判断"
    ],
    [
        "下面关键词词组中需要进行关键词数据清洗的是（）。",
        "连衣裙，长裙，官方正品长裙，长裙",
        "北京酒店，五星酒店，便宜的酒店，环境好的酒店",
        "热水器，大功率，省点节能，耐用",
        "手机，高清像素，大屏，粉色少女系",
        "",
        "A",
        "单选"
    ],
    [
        "小米手机在推广时将“好用的相机”这类关键词删除掉，这是依据（）来进行的关键词筛选。",
        "搜索指数",
        "品牌认知",
        "产品相关性",
        "用户称呼习惯",
        "",
        "C",
        "单选"
    ],
    [
        "关键词分布是指关键词在网页中出现的位置。关键词在正副标题、首段、正文中出现的位置等均与搜索引擎的（）存在直接影响",
        "权威性评判",
        "时效性评判",
        "丰富度评判",
        "相关性评判",
        "",
        "D",
        "单选"
    ],
    [
        "点击率一定的情况下，以下哪些关键词指标，可以反映出关键词的竞争力强弱？（）",
        "点击量",
        "跳出率",
        "转化率",
        "展现量",
        "",
        "AD",
        "多选"
    ],
    [
        "资讯类词是简短描述新闻事件、生活热点事件的关键词，下面关键词中属于资讯类词的是（）",
        "电饭锅能炖鸡吗",
        "小米手机价格",
        "鸿星尔克捐款 5 万",
        "如何理财",
        "",
        "C",
        "单选"
    ],
    [
        "重庆市某火锅店在当地以其正宗麻辣著名，且活动价限时5折优惠。为增加客流，店长决定利用搜索引擎推广官网，现需要对关键词“火锅”进行拓展，根据八爪鱼法可拓展为（）。",
        "重庆火锅",
        "正宗火锅",
        "麻辣火锅",
        "限时五折火锅",
        "",
        "ABCD",
        "多选"
    ],
    [
        "关键词的搜索指数高并不意味着就适合自己使用，例如实力较弱的企业进行搜索引擎营销时选择搜索指数高的行业大词会处于排名劣势，较难达到营销目的。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "某个关键词的展现量是2000，点击次数300，转化数是25，那么这个关键词的转化率是（）。",
        "0.125",
        "0.5",
        "0.15",
        "0.83",
        "",
        "D",
        "单选"
    ],
    [
        "按照关键词的长短可以将关键词分为长尾关键词和短尾关键词，下面关键词中属于长尾关键词的有（）",
        "在线课程多少钱",
        "哪里有好的培训机构",
        "手机",
        "机械设备公司",
        "",
        "ABD",
        "多选"
    ],
    [
        "“全球顶级医疗机构”这个关键词属于违规关键词，涉嫌虚假宣传，需要清洗掉。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "品牌未知受众的搜索词一般为通用词，当目标受众想要了解品类信息时，会使用通用词作为搜索条件查询相关信息，比如某目标受众想买一条项链，可能会搜的词是（）。",
        "潘多拉",
        "施华洛世奇",
        "蒂芙尼",
        "项链",
        "",
        "D",
        "单选"
    ],
    [
        "品牌未知受众的搜索词一般为通用词，当目标受众想要了解品类信息时，会使用通用词作为搜索条件查询相关信息，比如某未知受众想要购买一款吸尘器，她可能会搜索（）。",
        "德尔玛吸尘器",
        "美的",
        "吸尘器",
        "戴森",
        "",
        "C",
        "单选"
    ],
    [
        "认知阶段品牌推广对于企业而言有着十分特殊的意义，它实现了在搜索引擎上的品牌传播效能最大化，下面选项中属于认知阶段品牌推广的营销价值的是（）。",
        "沟通企业与受众",
        "易于目标受众接受",
        "增加权威性",
        "加深品牌认知",
        "",
        "ABCD",
        "多选"
    ],
    [
        "企业进行未知受众品牌推广后，目标受众搜索通用词时品牌信息独占首屏首位，下面关于未知受众品牌推广说法正确的是（）。",
        "可以展示品牌的加？v？认证、官网认证等信息",
        "侧面向目标受众传达品牌具有可靠性、权威性的信息",
        "搜索结果页图文并茂展现，视觉上更加吸引眼球",
        "可以一手操控品牌正面信息，支持图片、视频、文字的组合",
        "",
        "ABCD",
        "多选"
    ],
    [
        "目标受众对信息的吸纳，一般要经过“过滤”环节，只有那些对受众有用的、新鲜的、有特殊意义的信息，才有可能进入受众的“长时记忆”被存储起来。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "特定产品词一般是指具体的产品名称词，下面选项中属于特定产品词的是（）。",
        "汽车",
        "豪华型",
        "大众",
        "奔驰gls45",
        "",
        "D",
        "单选"
    ],
    [
        "处于认知阶段的目标受众通常会搜索哪些词来触达客户的广告？（）",
        "通用词",
        "具体产品词",
        "品牌词",
        "需求词",
        "",
        "BC",
        "多选"
    ],
    [
        "认知阶段品牌推广面向的是具有一定品牌认知度的目标受众。品牌广告展示于品牌词搜索结果页的首页首屏黄金位置，能够获得更多关注，容易给受众留下最佳的第一印象。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "某手机品牌需要进行未知受众的品牌推广，下面关键词设置合理的是（）。",
        "超高清像素",
        "超大显示屏",
        "手机",
        "华为mate4",
        "",
        "C",
        "单选"
    ],
    [
        "在百度进行认知阶段的品牌推广时不可购买的关键词包括（）。",
        "需求词",
        "通用词",
        "客服电话",
        "争议词",
        "",
        "ABCD",
        "多选"
    ],
    [
        "特定品牌词是指明确带有企业品牌名称的关键词。是网站、产品、服务的一个代表性的名字，子品牌词也是品牌词的范畴。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "特定品牌词是指明确带有企业品牌名称的关键词，下面选项不属于品牌词的是（）。",
        "空调",
        "格力",
        "美的",
        "海尔",
        "",
        "A",
        "单选"
    ],
    [
        "如果联想公司为“联想”这个关键词购买了品牌专区。当目标受众在百度上输入“联想'时，百度出现的第一条信息就是联想的品牌广告信息，当目标受众输入其他词时，就看不到联想公司的品牌广告信息。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "如果某企业的账户是按照设备类型来区分搭建的，那么他可以通过分析（）维度的数据来分析不同设备上的数据。",
        "推广计划",
        "推广单元",
        "创意",
        "关键词",
        "",
        "B",
        "单选"
    ],
    [
        "某化妆品企业目标转化成本为85元，分别在百度，头条，360和淘宝上投放了搜索推广广告，数据如下，对于（）渠道需要评估渠道是否还具有投放价值，是否放弃渠道，以节省人力物力。",
        "360：展现量1万，转化成本15元",
        "淘宝：展现量15万，转化成本95元",
        "头条：展现量15万，转化成本65元",
        "百度：展现量1万，转化成本7元",
        "",
        "A",
        "单选"
    ],
    [
        "在进行搜索竞价营销分析时，常见的基础数据指标有（）。",
        "点击",
        "展现量",
        "消费",
        "点击率",
        "",
        "ABCD",
        "多选"
    ],
    [
        "某游戏企业的用户受众活跃时间主要为工作日的18:00-23:59，以及周末的13:00-23：59，0:00-3:00，那么下面投放时段符合优化策略的是（）。",
        "周六：15:00-23:00",
        "周三：19:00-23:00",
        "周日：9:00-10:00",
        "周一：20:00-22:00",
        "",
        "ABD",
        "多选"
    ],
    [
        "对搜索账户进行优化时，为了保证创意足够丰富，能够吸引更多目标客户的关注，单元内需要添加多条创意。另外，为保证正常有效的推广，需检查每个单元中是否具备 2 条及以上创意。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "某化妆品企业目标转化成本为74元，分别在百度，头条，360和淘宝上投放了搜索推广广告，数据如下，对于（）渠道需要加大渠道的投放，并且在加大投放的过程中，要持续关注渠道质量的变化。",
        "360：展现量1万，转化成本15元",
        "头条：展现量15万，转化成本65元",
        "淘宝：展现量15万，转化成本95元",
        "百度：展现量1万，转化成本7元",
        "",
        "B",
        "单选"
    ],
    [
        "分析搜索竞价营销账户时，下面关于地域优化的说法正确的是（）。",
        "全国投放即可",
        "可以停掉效果较差的地域",
        "可以停掉业务基本不涉及的地域",
        "仅投放业务能涉及的地域",
        "",
        "BCD",
        "多选"
    ],
    [
        "搜索引擎推广关键词分析中，低消费高转化的关键词点击均价较低但关键词足够精确，需要重点关注。",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "如果某企业的账户是按照创意类型来区分搭建的，那么他可以通过分析（）维度的数据来分析不同类型创意的数据。",
        "推广单元",
        "关键词",
        "创意",
        "推广计划",
        "",
        "C",
        "单选"
    ],
    [
        "客服团队的（）等都可以影响转化效果。",
        "营销意识",
        "沟通技巧",
        "工作设备",
        "专业知识",
        "",
        "ABD",
        "多选"
    ],
    [
        "关于使用四象限分析法分析关键词并进行优化的说法正确的是（）。",
        "四象限分析法是指将关键词按照消费和转化分成四个象限，针对不同象限的关键词执行不同的优化调整",
        "可以分高消费高转化、低消费高转化、低消费低转化、高消费低转化四个象限分类的关键词",
        "高消费高转化的关键词需要重点关注，应该着重关注它的排名",
        "低消费高转化的关键词消费低说明展现少或被点击的次数少，转化高即为关键词足够精准",
        "",
        "ABCD",
        "多选"
    ],
    [
        "在对搜索引擎推广渠道进行分析时，可以从质量和流量两个角度进行分析。",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "在搜索竞价推广中，下面选项中不能单独设置出价系数的是（）。",
        "推广目标",
        "推广设备",
        "推广地域",
        "推广时段",
        "",
        "A",
        "单选"
    ],
    [
        "某企业对搜索竞价账户进行地域分析时，发现北京、上海、广东、山东四个地域的消费及转化率为：北京：10万，5%；上海：3万，8%，广东，1万，0.5%，山东：5万，7%，且公司业务主要集中在北方城市，那么下面哪个城市的推广业务可以暂停？（）",
        "广东",
        "北京",
        "山东",
        "上海",
        "",
        "A",
        "单选"
    ],
    [
        "以下操作中不能使创意飘红的是（）。",
        "创意有吸引力",
        "保证语句通顺",
        "添加通配符",
        "提高出价",
        "",
        "ABD",
        "多选"
    ],
    [
        "小刘设置关键词”智能语音电视”的匹配方式为短语精确包含，用户搜索词为（）时小刘的广告可能被展现。",
        "智能电话",
        "智能语音手表",
        "语音家电",
        "购买智能语音电视",
        "",
        "D",
        "单选"
    ],
    [
        "如果广告主选择使用cpc出价，实际参与竞价过程中，系统可能会参考（）值进行排序。",
        "点击率",
        "转化率",
        "ECPM",
        "cpm出价",
        "",
        "C",
        "单选"
    ],
    [
        "索引擎营销中的人群基础属性定向通常包括哪些维度（）。",
        "学历",
        "性别",
        "年龄",
        "人生阶段",
        "",
        "ABCD",
        "多选"
    ],
    [
        "为了迎合了当前大多数人快节奏的生活，各大制作公司和互联网平台纷纷尝试制作适合手机观看的竖屏剧、竖屏MV、竖屏综艺、竖屏广告，方便用户可以在社交媒体里直接转发整段视频，从而增强了竖屏视频的影响力。这段话，体现了企业在选择信息流广告投放平台时可以选择（）。",
        "优选广告位",
        "优选网络运营商",
        "按场景指定位置",
        "按媒体指定位置",
        "",
        "C",
        "单选"
    ],
    [
        "在资讯类的平台，一般目标受众使用此类平台是为了获取最新热点新闻信息，信息流广告最好采用（）形式。",
        "文字+小图",
        "文字+大图",
        "短视频",
        "纯文字",
        "",
        "B",
        "单选"
    ],
    [
        "下面对落地页的操作中可以提升推荐广告营销效果的有（）。",
        "展示卖点与痛点",
        "使用大段文字",
        "分渠道进行落地页设计",
        "信息分类",
        "",
        "ACD",
        "多选"
    ],
    [
        "如果企业将信息流广告中的单元出价设置为CPC=2元，下面说法正确的是（）。",
        "系统会按照点击扣费",
        "系统会按照展现扣费",
        "实际每个点击的花费不会超过2元",
        "实际每千次展现的价格不超过2元",
        "",
        "AC",
        "多选"
    ],
    [
        "信息流广告的创意、落地页等广告素材都存在自然衰退期，同一素材使用时间不宜过久。",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "如果某企业在信息流账户中设置的单元出价为OCPC=200元，表示他愿意为一次（）付出的价格。",
        "视频播放",
        "转化",
        "点击",
        "展现",
        "",
        "C",
        "单选"
    ],
    [
        "东方旅行社设置的信息流单元出价为CPM=20元，单元历史点击率为1.5%，那么参与竞价时的该单元的ECPM值是（）。",
        "15",
        "3",
        "C2",
        "D45",
        "",
        "C",
        "单选"
    ],
    [
        "某婴儿奶粉为0-3月龄营养均衡奶粉，其可能选择定向的目标人群标签为（）。",
        "18岁以下",
        "母婴亲子",
        "已婚",
        "女性",
        "",
        "BCD",
        "多选"
    ],
    [
        "酒店品牌在推荐平台发布作品后，内容平台会进行审核。下面的做法可能会被审核拒绝的是（）。",
        "发布损害未成年人健康的内容",
        "发布无资质发布的内容",
        "发布引人不适或反感的内容",
        "发布谣言或不实内容",
        "",
        "ABCD",
        "多选"
    ],
    [
        "内容推荐引擎的内容刻画是指机器提取内容中的关键词，或者利用 AI 技术识别音频与视频的具体内容，从而将内容快速分类、形成内容标签。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "亚特兰蒂斯酒店设置的信息流广告定向设置的投放人群的年龄为30-50岁的女性，以下哪个群体最容易刷到该商品的广告？（）",
        "家有小学生的宝妈们",
        "村口下象棋的大爷们",
        "公司中层男性领导",
        "高中生",
        "",
        "A",
        "单选"
    ],
    [
        "信息流广告的创意可以是不同形式的组合，下面关于常见组合形式的说法错误的是（）。",
        "文字+小图展现样式建议图片中尽量减少或不显示文字内容",
        "文字+小图展现样式的图片不必非常清晰，尺寸不限",
        "文字+大图展现样式建议尽量采用高清真实图片，让广告看起来有质感和可信度",
        "文字+大图展现样式可适当加入文字内容，如行动召唤类文案（倒计时、抢先购）、利益 诱惑类文案（免费送、买二送一）等",
        "",
        "B",
        "单选"
    ],
    [
        "广告中的智能出价代表去人工化的智能投放，系统自动帮助企业做广告投放优化，并能在企业规定的金额内完成营销目标，下面出价方式属于智能出价的是（）。",
        "CPM",
        "OCPC",
        "OCPM",
        "CPC",
        "",
        "BC",
        "多选"
    ],
    [
        "某护肤品品牌产品主打衰老肌恢复，主推女性市场，其推荐引擎广告应该锁定（）人群。",
        "4岁白领职业女性",
        "18岁以下学生",
        "35岁妈妈",
        "85岁以上老年人",
        "",
        "AC",
        "多选"
    ],
    [
        "内容推荐引擎过程中如果用户的阅读标签与内容分类和内容标签重合度越高，越被系统认定用户最可能对该内容感兴趣，内容就会被首次推荐给这批对其最可能感兴趣的用户。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "格林豪泰品牌的信息流账户点击率较高，但是页面的转化率较低，经分析发现落地页的相关性、核心内容、页面结构都无异常，还可以考虑从哪些方面分析？（）",
        "计划预算",
        "单元个数",
        "广告排名",
        "落地页的页面加载速度",
        "",
        "D",
        "单选"
    ],
    [
        "推荐引擎广告投放的展现量也会受预算影响，下面关于预算的设置说法错误的是（）。",
        "对于新广告计划，建议设置较高预算，保证初始的投放效果",
        "对于新广告计划，最好设置低预算",
        "在前期预算不足的情况下，需要根据流量需求调整优化投放策略，比如将预算优先集中在有效的投放时间段或进行有效的受众定向",
        "如果在推荐引擎广告营销中预算消耗过快，优化时可以考虑按照地域、平台等精细化分配预算",
        "",
        "B",
        "单选"
    ],
    [
        "小张在公司官网推广漏斗模型中发现点击量过低，导致这一结果的原因可能是（）。",
        "创意吸引力不足",
        "转化量过低",
        "出价过低，排名靠后",
        "目标受众不够精准",
        "",
        "ACD",
        "多选"
    ],
    [
        "企业进行信息流账户的场景定向效果分析时可以分析（）维度的定向效果。",
        "气候天气",
        "活动场景",
        "平台环境",
        "节日场景",
        "",
        "ABCD",
        "多选"
    ],
    [
        "对于进行线索收集的企业来说表单设计上一定要简化，同时简化表单填写步骤，只需引导填写主要信息即可，或者直接在表单最下方放置立即拨打电话按钮。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "对于信息流账户中点击率过低的单元，可能的原因是（）。",
        "单元出价过低",
        "落地页加载速度快",
        "计划设置的预算过低",
        "创意标题和内容不够吸引人",
        "",
        "D",
        "单选"
    ],
    [
        "推荐引擎推广数据细节维度分析不包括对（）的分析。",
        "创意效果",
        "关键词",
        "推广单元",
        "受众定向效果",
        "",
        "B",
        "单选"
    ],
    [
        "在进行广告推广效果分析时，通常可以从（）指标入手。",
        "转化成本",
        "展现量",
        "点击量",
        "转化率",
        "",
        "ABCD",
        "多选"
    ],
    [
        "如果信息流账户内转化成本较高，可以从（）方面来优化账户。",
        "提高出价",
        "优化投放时段，排除成本过高的时段",
        "增加投放平台",
        "优化定向人群，排除转化成本过高的劣质人群",
        "",
        "BD",
        "多选"
    ],
    [
        "推荐营销效果分析中的场景定向效果可以分析节日场景、活动场景、气候天气、平台环境的定向效果。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "某培训机构分析其效果数据时逐步分析了曝光量→点击量→线索量→付费转化量，这是使用了（）分析方法。",
        "交叉分析法",
        "四象限分析优化法",
        "漏斗分析法",
        "趋势分析法",
        "",
        "C",
        "单选"
    ],
    [
        "在获取数据时，如采用违法方式获取数据，会给企业带来刑 事风险，以下做法属于违法获取数据的是（）。",
        "提供专门用于侵入、非法控制计算机信息系统的爬虫，或者明知他 人实施侵入、非法控制计算机信息系统的违法犯罪行为而为其提供爬虫",
        "利用爬虫规避网站经营者设置的反爬虫措施非法获取竞争对手信息",
        "通过自己的营销后台下载数据",
        "利用爬虫非法侵入国家事务、国防建设、尖端科学技术领域的计算机信息 系统",
        "",
        "ABD",
        "多选"
    ],
    [
        "数字营销广告的数据标准化(normalization)是将数据按比例缩放，使之落入一个小的特定区间，使不同量级、不同单位的数据指标归为同一数量区间，下面方法中属于数据标准化的方法的是（）。",
        "z-socre 标准化",
        "Min-Max 标准化",
        "log 函数转换",
        "方差分析",
        "",
        "ABC",
        "多选"
    ],
    [
        "漏斗分析法常用于流失分析，可以分析主要流失的业务环节和流失原因，其作用是定位问题节点，找出问题的关键环节。",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "下面操作中，属于非法获取数据可能会给企业带来刑事风险的是（）。",
        "干扰被爬网站的正常运营",
        "利用爬虫规避网站经营者设置的反爬虫措施非法获取信息",
        "利用爬虫非法侵入国家事务、国防建设、尖端科学技术领域的计算机信息系统",
        "从搜索账户后台下载",
        "",
        "ABC",
        "多选"
    ],
    [
        "推广过程中，要通过合法的手段获取相关数据，如采用违法方式获取数据，会给企业带来刑事风险。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "\"Min-Max 标准化的公式为：标准化值=（原数据-最小值）/（最大值-最小值），将数据转化为 0～1 的不同值再转化为 10 分制，并采取进位制，保留整数，某企业在四个广告渠道A、B、C、D上的下载量分别为357",
        "1567",
        "1245",
        "832，那么按照Min-Max标准化后得分为10分的是（）渠道。\"",
        "A",
        "B",
        "D",
        "C",
        "",
        "B",
        "单选"
    ],
    [
        "进行营销账户的效果分析时，对比分析法是指将两个或两个以上的数据进行比较，分析它们的差异，下面关于对比分析法说法错误的是（）。",
        "对比的数据指标可以不一致",
        "对比的指标类型要一致",
        "数据之间要有可比性",
        "指标的口径范围、计算方法、计量单位要一致",
        "",
        "A",
        "单选"
    ],
    [
        "推荐引擎账户的效果分析中的对比分析法可以分为（）。",
        "动态比较",
        "Top N比较",
        "静态比较",
        "四象限法",
        "",
        "AC",
        "多选"
    ],
    [
        "对广告进行效果评估时需要选取样本数据，下面样本数据的选取正确的有（）。",
        "要对部分“离群值”进行剔除，即删除明显偏高或偏低的数据",
        "选取后的数据直接使用即可，无需筛选剔除",
        "样本数据的选取要考虑数据能代表统计周期内各广告营销渠道的正常投放效果",
        "选取样本数据时，一般以日数据为最小单位",
        "",
        "ACD",
        "多选"
    ],
    [
        "确定效果评估中的指标权重时要根据营销目标和评估目的，确定主要核心指标，赋予最高评分权重，其余指标按照排序进行递减。（）",
        "正确",
        "错误",
        " ",
        " ",
        "",
        "A",
        "判断"
    ],
    [
        "在数据获取环节，如采用违法方式获取数据，会给企业带来刑事风险，下面属于非法获取数据的操作的是（）。",
        "使用api接口将各平台开放的数据导入自己的crm系统",
        "爬取大量带有知识产权的数据",
        "广告平台提供的账户后台",
        "获取某商品评论信息",
        "",
        "C",
        "单选"
    ]
]
let yanshibuzhou = 1
let location_href = location.href
let nextone = '<button class="input" onclick="yanshibuzhou += 1;document.getElementById(\'yanshibuzhou\').remove();nexttoo()">下一步</button>'
window.addEventListener('load', function () {
    if (location_href.indexOf('lltk') != -1) {
        document.getElementById('yanshi').style.visibility = 'hidden'
        if (yanshibuzhou == 1) {
            sv = document.querySelector("#yanshi > table > tbody > tr:nth-child(1) > td:nth-child(1)")
            sv.style.visibility = 'visible'
            const div = document.createElement('div')
            div.id = 'yanshibuzhou'
            div.innerHTML = '仅可选择 <span style="color:#f368e0;font-weight: bold;font-size:30px">题库文件夹</span>中的文件(.csv)<br>' + nextone
            sv.appendChild(div)
        }
    }
})
function nexttoo() {
    if (yanshibuzhou == 2) {
        sv = document.querySelector("#yanshi > table > tbody > tr:nth-child(2) > td:nth-child(1) > span:nth-child(1)")
        sv.style.visibility = 'visible'
        const div = document.createElement('div')
        div.id = 'yanshibuzhou'
        div.innerHTML = '在做题时，不想做这题，且不想加入错题按这个<br>' + nextone
        sv.appendChild(div)
    }
    if (yanshibuzhou == 3) {
        sv = document.querySelector("#yanshi > table > tbody > tr:nth-child(2) > td:nth-child(1) > span:nth-child(2)")
        sv.style.visibility = 'visible'
        const div = document.createElement('div')
        div.style.marginLeft = '150px'
        div.id = 'yanshibuzhou'
        div.innerHTML = '按<span style="color:#f368e0;font-weight: bold;font-size:30px">“跳”</span>后，将跳至所填的指定题目<br>' + nextone
        sv.appendChild(div)
    }
    if (yanshibuzhou == 4) {
        sv = document.querySelector("#xianshidaan")
        sv.style.visibility = 'visible'
        const div = document.createElement('div')
        div.style.marginLeft = '300px'
        div.id = 'yanshibuzhou'
        div.innerHTML = '显示正在做的题目答案<br>' + nextone
        sv.appendChild(div)
    }
    if (yanshibuzhou == 5) {
        document.querySelector("#press").style.visibility = 'visible'
        document.querySelector("#yanshi > table > tbody > tr:nth-child(1) > td:nth-child(2) > button:nth-child(2)").style.visibility = 'visible'
        sv = document.querySelector("#yanshi > table > tbody > tr:nth-child(1) > td:nth-child(2)")
        const div = document.createElement('div')
        div.style.width = '500px'
        div.style.height = '150px'
        div.id = 'yanshibuzhou'
        div.innerHTML = '在做过题目后，可以选择导出错题 (重新选择题库文件将重置错题)<br>“csv” 可在本站 <span style="color:#f368e0;font-weight: bold;font-size:30px">导入错题</span> (不支持内置题库)<br>“docx” 导出错题Word（仅适配WPS）<br>' + nextone
        sv.appendChild(div)
    }
    if (yanshibuzhou == 6) {
        document.querySelector("#yanshi > table > tbody > tr:nth-child(1) > td:nth-child(2) > button:nth-child(3)").style.visibility = 'visible'
        sv = document.querySelector("#yanshi > table > tbody > tr:nth-child(1) > td:nth-child(2)")
        const div = document.createElement('div')
        div.style.width = '500px'
        div.style.height = '150px'
        div.id = 'yanshibuzhou'
        div.innerHTML = '<span style="color:#f368e0;font-weight: bold;font-size:30px">错题直导</span> 可以直接一键导入所做题库中做错的题<br>(由于调用的是浏览器缓存，请勿后退网页，有可能导致数据丢失)<br>(不一定适配所有电脑/浏览器)<br>' + nextone
        sv.appendChild(div)
    }
    if (yanshibuzhou == 7) {
        sv = document.querySelector("#table")
        document.getElementById('yanshi').style.visibility = 'visible'
        const div = document.createElement('div')
        div.style.width = '500px'
        div.style.height = '200px'
        div.id = 'yanshibuzhou'
        div.innerHTML = '答题区：<br>选择答案后点击 <span style="color:#f368e0;font-weight: bold;font-size:30px">下一题</span>，<br>如果回答错误，将会将所选选项标记为错误；<br>反之，则直接进入下一题<br>' + nextone
        sv.appendChild(div)
    }
    if (yanshibuzhou == 8) {
        alert('您已完成教学\n(公测版已支持自动本地存储做题进度,更换题库将丢失进度)')
        window.location.href = location_href.slice(0, location_href.indexOf('?'))
    }
}
let ll2tk_new_code = []
let huanti = 1
let jieguo = 'true'
let tiaoti = ''
let vioce = 'yes'
let cuoti = ''
let cuoti_html = ''
let xianshi = 'true'
let table_inner = ''
let allcuoti = []
let huan = 0

rechang = false
window.onload = function () {
    if (localStorage.getItem('num') != null) {
        try {
            new_code = eval(localStorage.getItem('tiku'));
            huanti = parseInt(localStorage.getItem('num'));
            new_codelength = parseInt(localStorage.getItem('new_codelength'))
            str_fileName = localStorage.getItem('str_fileName')
            allcuoti = eval(localStorage.getItem('allcuoti'))
            cuoti = localStorage.getItem('cuoti')
            cuoti_html = localStorage.getItem('cuoti_html')
            vioce = localStorage.getItem('vioce')
            if (vioce != 'yes') {
                document.getElementById('no').click()
            }
            if (huanti > new_codelength) {
                huanti = new_codelength
            }
            document.getElementById('xz').max = new_codelength
            document.getElementById('gongjiti').innerHTML = ' （共' + new_codelength + '题）'
            document.getElementById('xz').value = huanti
            qiehuan()
            document.getElementById('table').innerHTML = table_inner
        }
        catch (err) {
            console.log(err.message)
        }
    }
}
document.getElementById('excel')
    .addEventListener('change', function selectedFilechanged() {
        if (this.files.length === 0) {
            return;
        }
        const reader = new FileReader();
        reader.onload = function fileReadcompleted() {
            //当读取完如时，内容只在reader,result中
            csv = reader.result
            getcsv()
            new_codelength = new_code.length
            if (new_codelength == 0) { alert('您所上传的文件没有错题哦~') }
            document.getElementById('xz').max = new_codelength
            document.getElementById('gongjiti').innerHTML = ' （共' + new_codelength + '题）'
            qiehuan()
            document.getElementById('table').innerHTML = table_inner
            // localStorage.setItem('href', location.href);
            localStorage.setItem('tiku', JSON.stringify(new_code));
            localStorage.setItem('new_codelength', new_codelength)
            localStorage.setItem('str_fileName', str_fileName)
        };
        reader.readAsText(this.files[0], "GB2312");
        fileName = this.files[0].name;
        str_fileName = fileName.slice(0, fileName.indexOf('.'))
        huanti = 1
        cuoti = ''
        cuoti_html = ''
        allcuoti = []
        localStorage.setItem('num', huanti)
        localStorage.setItem('allcuoti', JSON.stringify(allcuoti))
        localStorage.setItem('cuoti', cuoti)
        localStorage.setItem('cuoti_html', cuoti_html)
        document.getElementById('xz').value = 1
        xsda = document.getElementById('xianshidaan')
        xsda.innerHTML = '<button class="input" onclick="xianshidaan()"><span>显示答案</span></button>'
        // console.log(str_fileName)
    })
function getcsv() {
    let code = csv.split(/[\r\n]+/); // 根据换行或者回车进行识别
    code.forEach((item, index) => { // 删除空项
        if (!item) {
            code.splice(index, 1);
        }
    })
    code = Array.from(new Set(code)); // 去重
    // console.log(code);
    new_code = []
    for (i = 0; i < code.length; i++) {
        old_code = code[i].split(/,/);
        new_code.push(old_code)
    }
    // console.log(new_code);
    // document.getElementById('stat').style.display = 'none'
}
function xz() {
    huanti = parseInt(document.getElementById('xz').value)
    tiaoti = 'true'
    xsda = document.getElementById('xianshidaan')
    xsda.innerHTML = '<button class="input" onclick="xianshidaan()"><span>显示答案</span></button>'
    yesno()

}
function tiao() {
    huanti = parseInt(huanti) + 1
    tiaoti = 'true'
    xsda = document.getElementById('xianshidaan')
    xsda.innerHTML = '<button class="input" onclick="xianshidaan()"><span>显示答案</span></button>'
    yesno()
}

function qiehuan() {
    huan = huanti - 1
    timu = new_code[huan][0]
    timuA = new_code[huan][1]
    timuB = new_code[huan][2]
    timuC = new_code[huan][3]
    timuD = new_code[huan][4]
    timuE = new_code[huan][5]
    daan = new_code[huan][6]
    str_fileName = new_code[huan][7]
    if (str_fileName == '单选') {

        table_inner = '<div>\
            <div id="zuoti">'+ huanti + '. (单选) ' + timu + '\
    <ol>\
        <input class="pinfen" type="radio" name="radio"  value="A" />\
        <span>'+ timuA + '</span>\
        <br>\
        <input  class="pinfen" type="radio" name="radio" value="B" />\
        <span>'+ timuB + '</span>\
        <br>\
        <input class="pinfen"  type="radio" name="radio" value="C" />\
        <span>'+ timuC + '</span>\
        <br>\
        <input class="pinfen"  type="radio" name="radio" value="D" />\
        <span>'+ timuD + '</span>\
    </ol>\
</div>'

    } else if (str_fileName == '多选') {

        table_inner = '<div>\
            <div id="zuoti">'+ huanti + '. (多选) ' + timu + '\
    <ol>\
        <input class="pinfen" type="checkbox" name="checkbox" value="A" />\
        <span>'+ timuA + '</span>\
        <br>\
        <input class="pinfen" type="checkbox"  name="checkbox" value="B" />\
        <span>'+ timuB + '</span>\
        <br>\
        <input class="pinfen" type="checkbox" name="checkbox"  value="C" />\
        <span>'+ timuC + '</span>\
        <br>\
        <input class="pinfen" type="checkbox" name="checkbox"  value="D" />\
        <span>'+ timuD + '</span>'
        if (timuE != '') {
            table_inner += '<br>\
        <input class="pinfen" type="checkbox" name="checkbox"  value="E" />\
        <span>'+ timuE + '</span>'
        }
        table_inner += '</ol>\
    </div>'
    }
    else if (str_fileName == '判断') {

        table_inner = '<div>\
            <div id="zuoti">'+ huanti + '. (判断) ' + timu + '\
    <ol>\
        <input class="pinfen" type="radio" name="radio" value="A" />\
        <span>'+ timuA + '</span>\
        <br>\
        <input class="pinfen" type="radio" name="radio" value="B" />\
        <span>'+ timuB + '</span>\
    </ol>\
</div>'
    }
    return table_inner
}


function dataaaa(newqw_code){
    new_code = newqw_code
    huanti = 1
    table_inner = qiehuan()
    document.getElementById('table').innerHTML = table_inner
    new_codelength = new_code.length
    if (new_codelength == 0) { alert('您所上传的文件没有错题哦~') }
    document.getElementById('xz').max = new_codelength
    document.getElementById('gongjiti').innerHTML = ' （共' + new_codelength + '题）'
}
function yesno(i) {
    if (huanti <= 1) {
        huanti = 1
    } else if (huanti > new_codelength) {
        huanti = new_codelength
    }
    localStorage.setItem('num', huanti)
    qiehuan()
    jieguo = duicuo()
    localStorage.setItem('tiku', JSON.stringify(new_code));
    localStorage.setItem('new_codelength', new_codelength)
    localStorage.setItem('str_fileName', str_fileName)
    localStorage.setItem('allcuoti', JSON.stringify(allcuoti))
    localStorage.setItem('cuoti', cuoti)
    localStorage.setItem('cuoti_html', cuoti_html)
    // console.log(huanti,biaozhun, answer, jieguo)
    if (jieguo == 'true') {
        xianshi = 'true'
        if (i == 1 | i == -1 | i == 0) {
            huanti = parseInt(huanti) + i
        }
        // huanti += i
        localStorage.setItem('num', huanti)
        tiaoti = 'false'
        if (huanti > new_codelength) {
            huanti = new_codelength
            alert('恭喜你完成本类试题的训练')
        }
        xsda = document.getElementById('xianshidaan')
        xsda.innerHTML = '<button class="input" onclick="xianshidaan()"><span>显示答案</span></button>'
        // console.log(vioce)
        qiehuan()
        // localStorage.setItem('href', location.href);
    }
    document.getElementById('xz').value = huanti
    document.getElementById('table').innerHTML = table_inner
    var obj = document.getElementsByClassName("pinfen");
    for (i = 0; i < obj.length; i++) {
        if (biaozhun.indexOf(obj[i].value) != -1) {
            if (answer.indexOf(obj[i].value) == -1) {
                // obj[i].checked = true
                var obj1 = document.getElementsByTagName("ol")[0].children;
                // console.log(obj1[(i + 1) * 3 - 2])
                obj1[(i + 1) * 3 - 2].innerHTML = '(错误) ' + obj1[(i + 1) * 3 - 2].innerHTML
                obj1[(i + 1) * 3 - 2].setAttribute('style', "color:red")
            } else if (answer.indexOf(obj[i].value) != -1 & jieguo != 'true') {
                var obj1 = document.getElementsByTagName("ol")[0].children;
                obj1[(i + 1) * 3 - 2].innerHTML = '(正确) ' + obj1[(i + 1) * 3 - 2].innerHTML
                obj1[(i + 1) * 3 - 2].setAttribute('style', "color:green")
            }

        }
    }
}
function daanhuoqu() {
    biaozhun = []
    // biaozhuni = []
    var obj = document.getElementsByClassName("pinfen");
    for (i = 0; i < obj.length; i++) {
        if (obj[i].checked) {
            biaozhun.push(obj[i].value)
            // biaozhuni.push(i)
        }
    }
    biaozhun = biaozhun.join()
    return biaozhun
}
function duicuo() {
    biaozhun = daanhuoqu()
    try {
        daann = daan.split('')
        answer = daann.join()
    } catch { answer = '' }
    if (biaozhun == answer) {
        jieguo = 'true'
        if (vioce == 'yes' & tiaoti != 'true') {
            var utterThis = new window.SpeechSynthesisUtterance('恭喜你做对了');
            window.speechSynthesis.speak(utterThis); //语音朗读
        }
    } else if (biaozhun != '' & biaozhun != answer) {
        jieguo = 'false'
        if (huanti != 1 & tiaoti != 'true' & vioce == 'yes') {
            var utterThis = new window.SpeechSynthesisUtterance('做错了，请重新做');
            window.speechSynthesis.speak(utterThis); //语音朗读
        }
        if (allcuoti.indexOf(timu) == -1) {//判断题目是否已被记录
            // csv版错题
            cuoti += timu + ',' + timuA + ',' + timuB + ',' + timuC + ',' + timuD + ',' + timuE + ',' + daan + ',' + str_fileName + '\n'
            // html版错题，可适配docx
            cuoti_html += '<h2><span style="mso-spacerun:\'yes\';margin-bottom:40px;padding-top:40px;font-family:黑体;mso-ascii-font-family:Calibri;mso-hansi-font-family:Calibri;mso-bidi-font-family:\'黑体\';mso-ansi-font-weight:bold;font-size:13.0000pt;mso-font-kerning:13.0000pt;">' + (allcuoti.length + 1) + '. (' + str_fileName + ') ' + timu + '</span></h2>'
            cuoti_html += '<p style="mso-spacerun:\'yes\';font-family:宋体;mso-ascii-font-family:Calibri;mso-hansi-font-family:Calibri;mso-bidi-font-family:\'Times New Roman\';font-size:12.0000pt;mso-font-kerning:1.0000pt;">' + timuA + '</p>'
            cuoti_html += '<p style="mso-spacerun:\'yes\';font-family:宋体;mso-ascii-font-family:Calibri;mso-hansi-font-family:Calibri;mso-bidi-font-family:\'Times New Roman\';font-size:12.0000pt;mso-font-kerning:1.0000pt;">' + timuB + '</p>'
            if (timuC != '') {
                cuoti_html += '<p style="mso-spacerun:\'yes\';font-family:宋体;mso-ascii-font-family:Calibri;mso-hansi-font-family:Calibri;mso-bidi-font-family:\'Times New Roman\';font-size:12.0000pt;mso-font-kerning:1.0000pt;">' + timuC + '</p>'
            }
            if (timuD != '') {
                cuoti_html += '<p style="mso-spacerun:\'yes\';font-family:宋体;mso-ascii-font-family:Calibri;mso-hansi-font-family:Calibri;mso-bidi-font-family:\'Times New Roman\';font-size:12.0000pt;mso-font-kerning:1.0000pt;">' + timuD + '</p>'
            }
            if (timuE != '') {
                cuoti_html += '<p style="mso-spacerun:\'yes\';font-family:宋体;mso-ascii-font-family:Calibri;mso-hansi-font-family:Calibri;mso-bidi-font-family:\'Times New Roman\';font-size:12.0000pt;mso-font-kerning:1.0000pt;">' + timuE + '</p>'
            }
            cuoti_html += '<p style="mso-spacerun:\'yes\';font-family:宋体;mso-ascii-font-family:Calibri;mso-hansi-font-family:Calibri;mso-bidi-font-family:\'Times New Roman\';mso-ansi-font-weight:bold;font-size:12.0000pt;mso-font-kerning:1.0000pt;">正确答案：' + daan + '</p>'
            cuoti_html += '<p></p>'
            // 存储题目
            allcuoti.push(timu)
        }
        console.log(biaozhun, answer, jieguo)
    }
    return jieguo
}
function dct() {
    var myselect = document.getElementById('press');
    var index = myselect.selectedIndex;
    var value = myselect.options[index].value;
    if (value == 'csv版') {
        var text = cuoti; //保存错题
        var blob = new Blob([text]);
        var anchor = document.createElement("a");
        anchor.download = '错题.csv';
    } else if (value == 'docx版(仅适配WPS)') {
        var text = '<h1>一、 ' + str_fileName + '</h1>' + cuoti_html; //保存错题
        var blob = new Blob([text]);
        var anchor = document.createElement("a");
        anchor.download = '错题.docx';
    }
    anchor.href = window.URL.createObjectURL(blob);
    anchor.target = "_blank";
    anchor.style.display = "none"; // just to be safe!
    document.body.appendChild(anchor);
    anchor.click();
    document.body.removeChild(anchor);
}
function xianshidaan() {
    if (xianshi == 'true') {
        if (jieguo == 'true') {
            jieguo = duicuo()
        }
        xsda = document.getElementById('xianshidaan')
        if (xsda.innerHTML.indexOf('正确') == -1) {
            const span = document.createElement('span')
            span.innerHTML = '<span style="font-size:12px">正确答案：</span><span>' + answer + '</span>'
            span.setAttribute('style', 'padding-right:20px')
            xsda.appendChild(span)
        }
        var obj = document.getElementsByClassName("pinfen");
        for (i = 0; i < obj.length; i++) {
            if (answer.indexOf(obj[i].value) != -1) {
                var obj1 = document.getElementsByTagName("ol")[0].children;
                if (obj1[(i + 1) * 3 - 2].innerHTML.indexOf('(正确)')) {
                    obj1[(i + 1) * 3 - 2].innerHTML = '(正确) ' + obj1[(i + 1) * 3 - 2].innerHTML
                    obj1[(i + 1) * 3 - 2].setAttribute('style', "color:green")
                }
            }
        }
    }
    xianshi = 'false'
}

function ll2ct() {
    if (location_href.indexOf('lltk') == -1) {
        window.location.href = '题库训练(错题版).htm?ll2ct';
        localStorage.setItem('ll2ct', cuoti);
        localStorage.setItem('num_shuaxinpanduan','false')
    }else{
        alert('正常点击会跳转，请在做题时体验')
    }
}